# The basic of pandas in import files

In [1]:
import pandas as pd

In [12]:
faturas = pd.read_csv('dataset/Sanduiches.txt', sep='\t')

In [13]:
faturas.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [18]:
usuarios = pd.read_csv('dataset/Users.txt', sep='|', header=None)

In [19]:
usuarios.head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [ ]:
# está sem coluna, com isso, vamos resolver na importação

In [21]:
colunas = ['id', 'idade', 'sexo', 'profissao', 'cep']

In [22]:
usuarios = pd.read_csv('dataset/Users.txt', sep='|', names=colunas)

In [23]:
usuarios.head()

   id  idade sexo   profissao    cep
0   1     24    M  technician  85711
1   2     53    F       other  94043
2   3     23    M      writer  32067
3   4     24    M  technician  43537
4   5     33    F       other  15213

# CSV - Type
##### link -> https://www.dropbox.com/sh/edmw38rfv6nw38z/AAAVG-JXIG17lIFQydRdrDwAa/Datasets?dl=0&preview=ufo.csv&subfolder_nav_tracking=1

In [25]:
ufo = pd.read_csv('dataset/ufo.csv')

In [28]:
ufo.describe()

           City Colors Reported Shape Reported  State              Time
count     18216            2882          15597  18241             18241
unique     6476              27             27     52             16145
top     Seattle             RED          LIGHT     CA  11/16/1999 19:00
freq        187             780           2803   2529                27

In [29]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

# TXT - Type - NaN 
#### Link -> https://www.dropbox.com/sh/edmw38rfv6nw38z/AAAGgfwhkWKcVE-0jNYzaQaaa/Datasets/LarguraFixa.txt?dl=0

In [30]:
df = pd.read_fwf('dataset/LarguraFixa.txt')

In [31]:
df.head()

,USAF,WBAN,STATION NAME,CTRY,ST,CALL,LAT,LON,ELEV(M),BEGIN,END
0,7005,99999,CWOS 07005,NaN,NaN,NaN,NaN,NaN,NaN,20120127,20120127
1,7011,99999,CWOS 07011,NaN,NaN,NaN,NaN,NaN,NaN,20111025,20121129
2,7018,99999,WXPOD 7018,NaN,NaN,NaN,0.0,0.0,7018.0,20110309,20130730
3,7025,99999,CWOS 07025,NaN,NaN,NaN,NaN,NaN,NaN,20120127,20120127
4,7026,99999,WXPOD 7026,AF,NaN,NaN,0.0,0.0,7026.0,20120713,20141120

# TXT - Type - Irregular spaces 
#### Link -> https://www.dropbox.com/sh/edmw38rfv6nw38z/AADpjNwRW20Zyw40PKhPf_lfa/Datasets/SepEspaco.txt?dl=0

In [35]:
df = pd.read_csv('dataset/SepEspaco.txt', sep=' ')# the separation is blanck spaces sep=' '

In [42]:
df.head(3)

,Year,Month,Day,Hour,Temp,DewTemp,Pressure,WindDir,WindSpeed,Sky,Precip1,Precip6
0,1912,4,1,6,114,94,10121,200,120,8,-9999,-9999
1,1912,4,1,9,146,96,10122,240,140,8,-9999,-9999
2,1912,4,2,6,172,122,10146,210,40,2,-9999,40

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 757 entries, 0 to 756
Data columns (total 12 columns):
Year         757 non-null int64
Month        757 non-null int64
Day          757 non-null int64
Hour         757 non-null int64
Temp         757 non-null int64
DewTemp      757 non-null int64
Pressure     757 non-null int64
WindDir      757 non-null int64
WindSpeed    757 non-null int64
Sky          757 non-null int64
Precip1      757 non-null int64
Precip6      757 non-null int64
dtypes: int64(12)
memory usage: 71.0 KB

# Writing TXT - Files

In [44]:
with open('dataset/teste.txt', 'w') as arq:
    arq.write('escrevendo alguma coisa')

In [45]:
data_w = open('dataset/teste.txt', 'r')

In [47]:
data_w.read()

'escrevendo alguma coisa'